app/views/bikes/index.html.erb

<%= link_to 'update bikes', {:controller => "bikes", :action => "index", :lastDate => @bikes.first.created_at }, :remote=> true, class: "updateLink" %>
---
SELECT "bikes".* FROM "bikes" ORDER BY created_at DESC LIMIT 5