app/controllers/bikes_controller.rb

def index
  @bikes = Bike.order('created_at DESC').limit(50).all
  if params[:lastDate] != nil
    lastDate = params[:lastDate]
    @bikesnew = @bikes.find_all { |bike| bike.created_at > (lastDate.to_time + 1.minutes).to_datetime }
---
SELECT "bikes".* FROM "bikes" ORDER BY created_at DESC
SELECT "bikes".* FROM "bikes" ORDER BY created_at DESC LIMIT 5